### For testing only

In [3]:
import pandas as pd
import numpy as np
import json

### Datas Acquision

In [4]:
list_of_name = ["Marwan", "Afnan", "Mukhlis", "Anas", "Khalid", "Iskandar", "Affan", "Ali"]

In [5]:
list_of_age = [21, 20, 21, 22, 20, 23, 22, 21]

In [6]:
list_of_job = ['it', 'rnd', 'it', 'eduction', 'libral art', 'islamic', 'it', 'rnd']

In [7]:
in_list = list(zip(list_of_name, list_of_age, list_of_job))

In [8]:
df = pd.DataFrame(in_list,  columns=['Name', 'Age', 'Job'])

In [9]:
df.set_index(['Name'], inplace=True)

In [10]:
df.head()

         Age         Job
Name
Marwan    21          it
Afnan     20         rnd
Mukhlis   21          it
Anas      22    eduction
Khalid    20  libral art

In [11]:
s = df.loc['Marwan']

In [12]:
pd.Series(s)

Age    21
Job    it
Name: Marwan, dtype: object

In [13]:
im = 'Test2.csv'

In [66]:
df1 = pd.read_csv(im, dtype={'Age':int})

In [67]:
df1.sort_index()

       Name  Age         Job
0    Marwan   21          it
1     Afnan   20         rnd
2   Mukhlis   21          it
3      Anas   22    eduction
4    Khalid   20  libral art
5  Iskandar   23     islamic
6     Affan   22          it
7       Ali   21         rnd

In [71]:
df1.dtypes

Name    object
Age      int32
Job     object
dtype: object

In [72]:
df1.sample(5)

       Name  Age         Job
2   Mukhlis   21          it
4    Khalid   20  libral art
0    Marwan   21          it
3      Anas   22    eduction
5  Iskandar   23     islamic

In [73]:
df1.Age.mean()

21.25